{
  "doc_id": "12345",
  "last_changed_date_time": "2024-07-09T12:00:00Z",
  "owner": "John Doe",
  "type": "claims",
  "content": "<!DOCTYPE html>\n<html lang=\"en\">\n<head>\n    <meta charset=\"UTF-8\">\n    <meta name=\"viewport\" content=\"width=device-width, initial-scale=1.0\">\n    <title>Sample HTML with Nested Tables</title>\n    <style>\n        body {\n            font-family: Arial, sans-serif;\n        }\n        table {\n            width: 100%;\n            border-collapse: collapse;\n        }\n        th, td {\n            border: 1px solid #ddd;\n            padding: 8px;\n        }\n        th {\n            background-color: #f4f4f4;\n        }\n    </style>\n</head>\n<body>\n\n    <header>\n        <h1>Company Quarterly Report</h1>\n    </header>\n\n    <main>\n        <section>\n            <h2>Overview</h2>\n            <p>This document provides an overview of the company's performance in the last quarter. It includes detailed tables and nested tables for specific departments and projects.</p>\n        </section>\n\n        <section>\n            <h2>Financial Summary</h2>\n            <table>\n                <thead>\n                    <tr>\n                        <th>Department</th>\n                        <th>Revenue</th>\n                        <th>Expenses</th>\n                        <th>Net Profit</th>\n                    </tr>\n                </thead>\n                <tbody>\n                    <tr>\n                        <td>Sales</td>\n                        <td>$1,200,000</td>\n                        <td>$800,000</td>\n                        <td>$400,000</td>\n                    </tr>\n                    <tr>\n                        <td>Marketing</td>\n                        <td>$500,000</td>\n                        <td>$300,000</td>\n                        <td>$200,000</td>\n                    </tr>\n                    <tr>\n                        <td>R&D</td>\n                        <td>$300,000</td>\n                        <td>$400,000</td>\n                        <td>-$100,000</td>\n                    </tr>\n                </tbody>\n            </table>\n        </section>\n\n        <section>\n            <h2>Project Details</h2>\n            <table>\n                <thead>\n                    <tr>\n                        <th>Project</th>\n                        <th>Status</th>\n                        <th>Details</th>\n                    </tr>\n                </thead>\n                <tbody>\n                    <tr>\n                        <td>Project Alpha</td>\n                        <td>Completed</td>\n                        <td>\n                            <table>\n                                <thead>\n                                    <tr>\n                                        <th>Task</th>\n                                        <th>Description</th>\n                                        <th>Completion Date</th>\n                                    </tr>\n                                </thead>\n                                <tbody>\n                                    <tr>\n                                        <td>Research</td>\n                                        <td>Generative AI refers to a category of artificial intelligence algorithms that generate new content, whether it be images, text, or audio, that is similar to the data it was trained on. These algorithms, particularly those based on deep learning models such as Generative Adversarial Networks (GANs) and Variational Autoencoders (VAEs), have shown remarkable capabilities in creating realistic data. For example, GANs consist of two neural networks: a generator that creates new data instances, and a discriminator that evaluates them. This dynamic creates a feedback loop where the generator improves over time. Applications of generative AI are vast, spanning from creating art and music to drug discovery and enhancing medical imaging. The research phase involved a thorough exploration of current generative AI technologies, understanding their underlying mechanisms, potential applications, and ethical considerations. Extensive literature reviews, experiments with existing models, and consultations with experts were conducted to gather comprehensive insights.\n                                            In the rapidly evolving field of artificial intelligence (AI) and natural language processing (NLP), Retrieval-Augmented Generation (RAG) represents a significant advancement. This technology combines the strengths of retrieval-based and generative models to create a more powerful and versatile system for various applications, from answering questions to generating detailed and contextually accurate text. This comprehensive guide delves deep into the principles, mechanisms, and applications of RAG, providing an extensive understanding of its potential and implications.\n\n1. Introduction to Retrieval-Augmented Generation (RAG)\n\n1.1. Definition and Concept\n\nRetrieval-Augmented Generation (RAG) is a hybrid model that integrates the retrieval capabilities of traditional search engines with the generative prowess of modern language models. The core idea is to enhance the generative model’s outputs by incorporating relevant information retrieved from a vast corpus of text. This combination allows RAG to produce more accurate, informative, and contextually appropriate responses.\n                                        </td>\n                                        <td>2023-04-01</td>\n                                    </tr>\n                                    <tr>\n                                        <td>Development</td>\n                                        <td>Developed the product prototype based on research findings and initial customer feedback.</td>\n                                        <td>2023-06-15</td>\n                                    </tr>\n                                    <tr>\n                                        <td>Testing</td>\n                                        <td>Conducted thorough testing to ensure the product meets quality standards and customer expectations.</td>\n                                        <td>2023-08-10</td>\n                                    </tr>\n                                </tbody>\n                            </table>\n                        </td>\n                    </tr>\n                    <tr>\n                        <td>Project Beta</td>\n                        <td>Ongoing</td>\n                        <td>\n                            <table>\n                                <thead>\n                                    <tr>\n                                        <th>Task</th>\n                                        <th>Description</th>\n                                        <th>Estimated Completion</th>\n                                    </tr>\n                                </thead>\n                                <tbody>\n                                    <tr>\n                                        <td>Planning</td>\n                                        <td>Detailed planning and resource allocation for the project.</td>\n                                        <td>2024-01-15</td>\n                                    </tr>\n                                    <tr>\n                                        <td>Execution</td>\n                                        <td>Initial phase of project execution including milestone settings and team meetings.</td>\n                                        <td>2024-04-30</td>\n                                    </tr>\n                                    <tr>\n                                        <td>Monitoring</td>\n                                        <td>Regular monitoring and updates to ensure the project stays on track.</td>\n                                        <td>2024-07-01</td>\n                                    </tr>\n                                </tbody>\n                            </table>\n                        </td>\n                    </tr>\n                </tbody>\n            </table>\n        </section>\n    </main>\n\n    <footer>\n        <p>&copy; 2024 Company Name. All rights reserved.</p>\n    </footer>\n\n</body>\n</html>"
}